In [1]:
import pandas as pd
import numpy as np
import seaborn as sns

In [33]:
customers = pd.read_excel("CUSTOMERS.xlsx")
employees = pd.read_excel("EMPLOYEES.XLSX")
items = pd.read_excel("ITEMS.XLSX")
orderInfo = pd.read_excel("ORDERINFO.XLSX")
orders = pd.read_excel("ORDERS.XLSX")

In [3]:
print(customers.columns)
print(employees.columns)
print(items.columns)
print(orderInfo.columns)
print(orders.columns)

Index(['Customer ID', 'Title', 'First Name', 'Last Name'], dtype='object')
Index(['Employee Code', 'First Name', 'Last Name'], dtype='object')
Index(['Item No', 'CD ROM Title', 'Cost Price', 'Nominal Sale Price'], dtype='object')
Index(['Order No', 'Item No', 'Quantity'], dtype='object')
Index(['Order No', 'Customer ID', 'Employee Code', 'Order Date',
       'Dispatch Date', 'total'],
      dtype='object')

In [36]:
orderInfo.head()

   Order No  Item No  Quantity
0         1       68         1
1         1       99         1
2         1      119         1
3         2       36         1
4         2      101         1

In [53]:
orderInfo["Item No"].unique().size

150

In [55]:
orderInfo["Item No"].size

461840

In [44]:
orderInfo.loc[orderInfo.Quantity>1]

        Order No  Item No  Quantity
16             6      105         2
25            10      104         3
66            23      145         2
94            32       15         2
132           45      141         2
...          ...      ...       ...
461656    149941        4         2
461686    149949       39         3
461738    149968      120         3
461814    149994       38         2
461826    149999       22         2

[13807 rows x 3 columns]

In [46]:
orders[orders["Order No"]==23]

    Order No  Customer ID  Employee Code Order Date Dispatch Date  total
21        23         1154              3 2010-02-22    2010-02-23  94.05

In [47]:
orderInfo[orderInfo["Order No"]==23]

    Order No  Item No  Quantity
64        23       99         1
65        23      141         1
66        23      145         2

In [37]:
orders.head()

   Order No  Customer ID  Employee Code Order Date Dispatch Date  total
0         1         3843             53 2010-02-22    2010-03-01  49.53
1         2         1733            167 2010-02-22    2010-02-23  34.58
2         3         5739             73 2010-02-22    2010-03-03  49.29
3         4         7706              9 2010-02-22    2010-03-01  34.30
4         5         5176            168 2010-02-22    2010-03-08  34.77

In [38]:
items.head()

   Item No                CD ROM Title  Cost Price  Nominal Sale Price
0        1            He lives to fish   14.675622           14.891067
1        2           He fishes to live   24.148495           25.236653
2        3                 Eating well   21.446596           23.569391
3        4        Advanced programming   18.009628           19.066674
4        5  Bridge building as a hobby   12.498061           12.698721

In [39]:
employees.head()

   Employee Code First Name Last Name
0              1      Helen  Ferguson
1              2  Catherine    Murray
2              3       Owen   Edwards
3              4   Margaret     Price
4              5      Emily     Smith

In [40]:
customers.head()

   Customer ID Title First Name Last Name
0            1    Mr       Alan   Perkins
1            2   Mrs        May     Smith
2            3    Ms       Mary    Birnie
3            4    Ms     Lilian      Ward
4            5    Mr     Thomas  Johnston

In [34]:
orders["Employee Code"].unique()

array([ 53, 167,  73,   9, 168,  96, 149, 165,  62,   7, 147,  90, 135,
        19, 106,  55,  72,  10, 126,  84,   3, 171, 181, 152, 172,  34,
        86,  63,  56,  97, 160,  15, 133,  35, 101,  17,  82, 161, 107,
         6,  37, 136, 173,  54,  77, 132, 154,  29, 145, 197, 179, 108,
        61,  66, 115,  20, 137,  22, 114, 112, 199, 140,  75,  14, 139,
        26,  98, 129, 180,  30, 111,  48, 146,  60,  40, 143,  78,  50,
       141, 195, 188,  21, 119,  76, 190,  43, 200, 155, 116,  51, 194,
        71, 150,  79, 130, 174,  25,   2, 187,  45, 198, 142, 178,  38,
        95,  13,  11, 103, 102,  70,  27, 183, 138, 123, 120, 191,  93,
       189, 170, 148,  44,  47,  33, 182,  91, 100, 159, 110, 192,  32,
       162, 177, 186,  39, 121, 176,  46,  64, 127,  57,  67, 196, 166,
        31,  92, 144, 118,   5,  89, 156,  36, 175, 113,  52,  59, 185,
       184,   8,  80, 193, 151,  87,  81,  58,  42, 105,   4, 122,  12,
       157,  88, 134, 169,  83, 117, 131,  99, 158,   1, 124, 163,  49,
        68,  41, 128,  85, 109, 153, 164, 125,  18,  65,  16,  74,  28,
        23,  69,  94,  24, 104], dtype=int64)

In [35]:
orders["Employee Code"].count()

149425

## Understanding the data

In [11]:
import seaborn as sns

In [12]:
orderInfo.head(3)

   Order No  Item No  Quantity
0         1       68         1
1         1       99         1
2         1      119         1

In [14]:
orders.head()

   Order No  Customer ID  Employee Code Order Date Dispatch Date  total
0         1         3843             53 2010-02-22    2010-03-01  49.53
1         2         1733            167 2010-02-22    2010-02-23  34.58
2         3         5739             73 2010-02-22    2010-03-03  49.29
3         4         7706              9 2010-02-22    2010-03-01  34.30
4         5         5176            168 2010-02-22    2010-03-08  34.77

In [15]:
orders[orders["Order No"]==1]['total']

0    49.53
Name: total, dtype: float64

In [16]:
items_1 = orderInfo[orderInfo["Order No"]==1]['Item No']

In [17]:
items_1

0     68
1     99
2    119
Name: Item No, dtype: int64

In [18]:
res =0
for x in items_1:
    res = res + sum(items[items["Item No"]==x]["Nominal Sale Price"])

In [19]:
items.head()

   Item No                CD ROM Title  Cost Price  Nominal Sale Price
0        1            He lives to fish   14.675622           14.891067
1        2           He fishes to live   24.148495           25.236653
2        3                 Eating well   21.446596           23.569391
3        4        Advanced programming   18.009628           19.066674
4        5  Bridge building as a hobby   12.498061           12.698721

In [20]:
res

39.2012973037017

In [21]:
x = items[items["Item No"]==119]["Nominal Sale Price"].values + items[items["Item No"]==68]["Nominal Sale Price"].values+ items[items["Item No"]==99]["Nominal Sale Price"].values

In [22]:
x

array([39.2012973])

In [23]:
items

     Item No                CD ROM Title  Cost Price  Nominal Sale Price
0          1            He lives to fish   14.675622           14.891067
1          2           He fishes to live   24.148495           25.236653
2          3                 Eating well   21.446596           23.569391
3          4        Advanced programming   18.009628           19.066674
4          5  Bridge building as a hobby   12.498061           12.698721
..       ...                         ...         ...                 ...
145      146                  City Foxes   11.174949           11.613233
146      147              Basso profundo   21.969830           22.826450
147      148            The Xerafin Wars    3.285135            3.455926
148      149     Ophelia among the stars    5.075280            5.352100
149      150       Sir Nigel's Marmalade   13.258119           14.553032

[150 rows x 4 columns]

In [24]:
orders.head(2)

   Order No  Customer ID  Employee Code Order Date Dispatch Date  total
0         1         3843             53 2010-02-22    2010-03-01  49.53
1         2         1733            167 2010-02-22    2010-02-23  34.58

In [25]:
orders["Employee Code"].value_counts()

3      2596
79      814
140     801
14      799
6       796
       ...
25      654
67      649
23      640
2       358
4       343
Name: Employee Code, Length: 200, dtype: int64

In [26]:
orderInfo.head(3)

   Order No  Item No  Quantity
0         1       68         1
1         1       99         1
2         1      119         1

In [27]:
orderInfo["Order No"].value_counts()>1

143573     True
73921      True
102588     True
143809     True
16119      True
          ...
6829      False
15333     False
92683     False
88589     False
64983     False
Name: Order No, Length: 149404, dtype: bool

In [28]:
orders.head(3)

   Order No  Customer ID  Employee Code Order Date Dispatch Date  total
0         1         3843             53 2010-02-22    2010-03-01  49.53
1         2         1733            167 2010-02-22    2010-02-23  34.58
2         3         5739             73 2010-02-22    2010-03-03  49.29

In [29]:
orders[orders.total > 270]

       Order No  Customer ID  Employee Code Order Date Dispatch Date   total
5047       5049         5765              3 2010-04-30    2010-05-14  274.23
15109     15111         7615            140 2010-09-20    2010-10-04  274.37
32106     32108         5273            170 2011-05-17    2011-05-27  274.43
53230     53232         3929             50 2012-03-08    2012-03-27  274.16

In [30]:
orderInfo.head(3)

   Order No  Item No  Quantity
0         1       68         1
1         1       99         1
2         1      119         1

In [31]:
mergedItems = pd.merge(orders, orderInfo, how='left', on="Order No")

In [32]:
mergedItems

,Order No,Customer ID,Employee Code,Order Date,Dispatch Date,total,Item No,Quantity
0,1,3843,53,2010-02-22,2010-03-01,49.53,68.0,1.0
1,1,3843,53,2010-02-22,2010-03-01,49.53,99.0,1.0
2,1,3843,53,2010-02-22,2010-03-01,49.53,119.0,1.0
3,2,1733,167,2010-02-22,2010-02-23,34.58,36.0,1.0
4,2,1733,167,2010-02-22,2010-02-23,34.58,101.0,1.0
...,...,...,...,...,...,...,...,...
461856,149999,2213,38,2015-11-24,2015-11-25,184.58,110.0,1.0
461857,150000,2649,36,2015-11-24,2015-12-14,64.37,44.0,1.0
461858,150000,2649,36,2015-11-24,2015-12-14,64.37,64.0,1.0
461859,150000,2649,36,2015-11-24,2015-12-14,64.37,117.0,1.0
461860,150000,2649,36,2015-11-24,2015-12-14,64.37,120.0,1.0